#+TITLE: CONDITIONAL STATEMENTS - NESTING STACKING SWITCHING
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: DSC 205 - Advanced introduction to data science
#+STARTUP: overview hideblocks indent inlineimages
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
#+attr_html: :width 300px
* Example: nesting

- In pseudocode notation:
  #+begin_example
  IF a <= mynumber
     assign `a^2` to a
     IF mynumber > 3
        assign `seq(1,a,length=mynumber)` to b
     ELSE
        assign `a * mynumber` to b
  ELSE
     assign `a-3.5` to a
     IF mynumber >= 4
        assign `a^(3-mynumber)` to b
     ELSE
        assign `rep(a + mynumber, times=3)` to b
  #+end_example

- Nesting different statements for two variables ~a~ and ~mynumber~ (Note
  that this code block on its own will not run because the variables
  are unknown.)
  #+name: nested
  #+begin_src R :results silent
    if(a <= mynumber) {
      cat("First condition was TRUE\n")
      a <- a^2
      if(mynumber > 3) {
        cat("Second condition was TRUE\n")
        b <- seq(1,a,length=mynumber)
      } else {
        cat("Second condition was FALSE\n")
        b <- a * mynumber
      }
    } else {
      cat("First condition was FALSE\n")
      a <- a - 3.5
      if(mynumber >= 4) {
        cat("Second condition was TRUE\n")
        b <- a^(3-mynumber)
      } else {
        cat("Second condition was FALSE\n")
        b <- rep(a + mynumber, times=3)
      }
    }
    a
    b
  #+end_src

- Run this code with ~a <- 3~ and ~mynumber <- 4:~ [fn:1]
  #+begin_src R
    a <- 3
    mynumber <- 4
    <<nested>>
  #+end_src

  #+RESULTS:
  : First condition was TRUE
  : Second condition was TRUE
  : [1] 9
  : [1] 1.000000 3.666667 6.333333 9.000000

- Reset ~a <- 6~ and ~mynumber <- 4~ and run the nested statements
  again. This time the first condition is not met but the second is,
  and ~b~ is computed with the new value of ~a~:
  #+begin_src R
    a <- 6
    mynumber <- 4
    <<nested>>
  #+end_src

  #+RESULTS:
  : First condition was FALSE
  : Second condition was TRUE
  : [1] 2.5
  : [1] 0.4

* The ~switch~ function for ~character~ strings

- If you need to choose code based on the value of a single object,
  you can use a series of stacked ~if~ statements.

- Example: assign a ~numeric~ value to ~foo~ where the number depends on
  the value of ~mystring~:
  #+name: simpsons
  #+begin_src R :results silent
    if ( mystring == "Homer" ) {
      foo <- 12
    } else if ( mystring == "Marge" ) {
      foo <- 34
    } else if ( mystring == "Bart" ) {
      foo <- 56
    } else if ( mystring == "Lisa" ) {
      foo <- 78
    } else if ( mystring == "Maggie") {
      foo <- 90
    } else {
      foo <- NA
    }
    foo
  #+end_src

- Example runs:
  #+begin_src R
    mystring <- "Lisa"    # matched with foo = 78
    <<simpsons>>
    mystring <- "Peter"   # not in the list
    <<simpsons>>
  #+end_src

- The ~switch~ function behaves like a set of stacked ~if~
  statements. Take a look at ~help(switch)~ to see its definition.

- Using the "Simpsons" example from before:
  #+name: switch
  #+begin_src R
    foo <- switch(
      EXPR = mystring,
      Homer=12,
      Marge=34,
      Bart=56,
      Lisa=78,
      Maggie=90,
      NA)
    foo
  #+end_src

- Example runs:
    #+begin_src R
    mystring <- "Lisa"    # matched with foo = 78
    <<switch>>
    mystring <- "Peter"   # not in the list
    <<switch>>
  #+end_src

  #+RESULTS:
  : [1] 78
  : [1] NA

- The first argument ~EXPR~ can be ~numeric~ or a ~character~ string

- The remaining arguments provide the values or operations based on
  the value of ~EXPR~. 

